#Область ОбработчикиСобытийФормы   

  &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого ОбъектМ Из Метаданные.Справочники Цикл
		
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Представление = ОбъектМ;
		НоваяСтрока.ОбъектМетаданных = ОбъектМ.Имя;
		
	КонецЦикла;	
	
	
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура ВыбратьОбъект(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные; 
	СтруктураДанных = Новый Структура("Представление,ОбъектМетаданных",ТекДанные.Представление,ТекДанные.ОбъектМетаданных);
	Оповестить("ВыборОбъектаМетаданныхОбработкаExcel",СтруктураДанных);
    Закрыть();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы    
&НаКлиенте
Процедура СписокПредставлениеПриИзменении(Элемент)
	ПопыткаИзмененияСписка();
КонецПроцедуры
&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ПопыткаИзмененияСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПопыткаИзмененияСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ПопыткаИзмененияСписка();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиентеНаСервереБезКонтекста
Процедура ПопыткаИзмененияСписка()

	Возврат;

КонецПроцедуры



#КонецОбласти