
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	
	ТаблицаРЗ = Новый ТаблицаЗначений;
	ТаблицаРЗ.Колонки.Добавить("НаименованиеРЗ");
	ТаблицаРЗ.Колонки.Добавить("Включено");
	ТаблицаРЗ.Колонки.Добавить("Идентификатор");
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("");
	МассивИсключений.Добавить("Пользователь");
	
	Для каждого Рз Из МассивЗаданий Цикл
		
		Если МассивИсключений.Найти(Рз.ИмяПользователя) <> Неопределено Тогда
			
			НоваяСтрокаТЗ = ТаблицаРЗ.Добавить();
			
			Если РЗ.Наименование <> "" Тогда
				НоваяСтрокаТЗ.НаименованиеРЗ =  РЗ.Наименование;
			Иначе
				Если РЗ.Метаданные.Синоним = "" Тогда
					НоваяСтрокаТЗ.НаименованиеРЗ =  РЗ.Метаданные.Имя;
				Иначе	
					НоваяСтрокаТЗ.НаименованиеРЗ =  РЗ.Метаданные.Синоним;
				КонецЕсли; 
			КонецЕсли;
            НоваяСтрокаТЗ.Включено = РЗ.Использование;
			НоваяСтрокаТЗ.Идентификатор = Рз.УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;  
	
	ТаблицаРЗ.Сортировать("Включено УБЫВ");
	
	НаборДанных = Новый Структура("ТабРегЗаданий",ТаблицаРЗ);
	
    СхемаКД = Отчеты.РегЗадания.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастрйокиКД = КомпоновщикНастроек.ПолучитьНастройки();
	Компановщикмакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = Компановщикмакета.Выполнить(СхемаКД,НастрйокиКД,ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(Макет,НаборДанных,ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКД);

КонецПроцедуры
