Функция ЗначениеРасшифровки (ДанныеРасшифровки,Расшифровка) Экспорт
	
	Если ЭтоАдресВременногоХранилища(ДанныеРасшифровки) Тогда
		Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
		
        ЭлементРасшифровки = Данные.Элементы[Расшифровка];
		
		Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
        
        // Берем первое доступное значение поля
	        Для Каждого ЗначениеПоля Из ЭлементРасшифровки.ПолучитьПоля() Цикл
	            Возврат ЗначениеПоля.Значение;
	        КонецЦикла;
		КонецЕсли;
		
    КонецЕсли;
		
		
	

КонецФункции // ()
