#Область СлужебныйПрограммныйИнтерфейс

Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияПередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ);
	
КонецПроцедуры

Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт

	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ);

КонецПроцедуры

Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти