#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ОбменДанными
	ОбменДаннымиСервер.ФормаУзлаПриСозданииНаСервере(ЭтаФорма, Отказ);
	// Конец СтандартныеПодсистемы.ОбменДанными

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	// СтандартныеПодсистемы.ОбменДанными
	Оповестить("Запись_УзелПланаОбмена");
	// Конец СтандартныеПодсистемы.ОбменДанными

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.ОбменДанными
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
	// Конец СтандартныеПодсистемы.ОбменДанными

КонецПроцедуры

#КонецОбласти