

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура ВыгрузитьДанные(Команда)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.МножественныйВыбор = Ложь;
	Каталог = Ждать Диалог.ВыбратьАсинх();
	
	ПутьККаталогу = Каталог[0];
	
	ФайлКаталог = Новый Файл(ПутьККаталогу);
	Если Не ФайлКаталог.Существует() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Каталог не существует или не выбран");
	КонецЕсли;	
	ПутьККаталогу = ПутьККаталогу+"/Результат.XLSX";
	Попытка
		
		ВыгрузитьДанныеНаСервере();	
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена!");
		
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка выгрузки!");
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОбъект(Команда)
	ОткрытьФорму("Обработка.ВыгрузкаСправочникаВExcel.Форма.ФормаПодбора",,ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	
	ТекстЗапроса = СформироаватьТекстЗапроса(ОбъектВыгрузки[0].ОбъектМетаданных);
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	НомерСтроки = 1;
	Для ИндексКолонки = 0 По ТаблицаЗначений.Колонки.Количество() - 1 Цикл
		Ячейка = ТабличныйДокумент.Область(НомерСтроки, ИндексКолонки + 1);
		Ячейка.Текст = ТаблицаЗначений.Колонки[ИндексКолонки].Имя;
		Ячейка.Шрифт = Новый Шрифт(,,Истина); // Жирный шрифт
	КонецЦикла;
	
	// Заполняем строки данными
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл
		НомерСтроки = НомерСтроки + 1;
		Для ИндексКолонки = 0 По ТаблицаЗначений.Колонки.Количество() - 1 Цикл
			ИмяКолонки = ТаблицаЗначений.Колонки[ИндексКолонки].Имя;
			ТабличныйДокумент.Область(НомерСтроки, ИндексКолонки + 1).Текст = СтрокаТЗ[ИмяКолонки];
		КонецЦикла;
	КонецЦикла;
	ТабличныйДокумент.Записать(ПутьККаталогу,ТипФайлаТабличногоДокумента.XLSX);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироаватьТекстЗапроса(ИмяСправочника)
	
	ТекстЗапросаВставка = 
	"ВЫБРАТЬ
	|	Справочник.Ссылка КАК Ссылка,
	|   &Допстроки
	|ИЗ
	|	Справочник.&ИмяСправочника КАК Справочник";
	
	Объединение = 
	"|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	ВставкаСтрокиЗапроса = " Справочник.&ИмяРеквизита Как &ИмяРеквизита" ;
	СтрокиЗапроса = "";
	ТекстЗапроса = "";
	
	ПерваяВставка = Истина;
	Счетчик = 1;
	Для Каждого Реквизит Из Метаданные.Справочники[ИмяСправочника].Реквизиты Цикл
		ЧислоВставок = Метаданные.Справочники[ИмяСправочника].Реквизиты.Количество();
		
		//Если Не ПерваяВставка Тогда
		//	ТекстЗапроса = ТекстЗапроса + Объединение;
		//КонецЕсли;
		//
		//Если ПерваяВставка Тогда
		//	ПерваяВставка = Ложь;
		//КонецЕсли;
		
		СтрокиЗапроса = СтрокиЗапроса+ВставкаСтрокиЗапроса;
		СтрокиЗапроса = СтрЗаменить(СтрокиЗапроса,"&ИмяРеквизита",Реквизит.Имя);
		
		
		
		Если Счетчик <> ЧислоВставок Тогда
			СтрокиЗапроса = СтрокиЗапроса+","+ Символы.ПС;	
		КонецЕсли;	
		
		Счетчик = Счетчик+1;
	КонецЦикла;	
	
	ТекстЗапроса = ТекстЗапроса+ТекстЗапросаВставка;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИмяСправочника",ИмяСправочника);
	ТекстЗапроса =  СтрЗаменить(ТекстЗапроса,"&Допстроки",СтрокиЗапроса);
	Возврат ТекстЗапроса;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия ="ВыборОбъектаМетаданныхОбработкаExcel" Тогда 
		ОбъектВыгрузки.Очистить();
		НоваяСтрока = ОбъектВыгрузки.Добавить();
		НоваяСтрока.Представление = Параметр.Представление;
		НоваяСтрока.ОбъектМетаданных = Параметр.ОбъектМетаданных;
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти

